%%%-------------------------------------------------------------------
%%% @author pma1604
%%% @copyright (C) 2014, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 26. Oct 2014 19:21
%%%-------------------------------------------------------------------
-module(p03).
-author("pma1604").
%%%-------------------------------------------------------------------
%  P03  (*)  Найти  N-й  элемент  списка:
%  Пример:
%  1> p03 : element_at ([a,b,c,d,e,f],4).
%  d
%  2> p03 : element_at ([a,b,c,d,e,f],10).
%  undefined
%%%-------------------------------------------------------------------

%% API
-export([element_at/2]).

element_at([H|_],1)->
  H;
element_at([_H|T],Num) ->
  element_at(T,Num-1);
element_at([],_) ->
  undefined.
