%%%-------------------------------------------------------------------
%%% @author pma1604
%%% @copyright (C) 2014, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 26. Oct 2014 20:16
%%%-------------------------------------------------------------------
-module(p06).
-author("pma1604").

%% API
%%%-------------------------------------------------------------------
%P06 (*) Определить, является ли список палиндромом:
%Пример:
%1> p06:is_palindrome([1,2,3,2,1]).
%true
%%%-------------------------------------------------------------------
-export([is_palindrome/1]).
is_palindrome(List) ->
   Rlist = p05:reverse(List),
   List=:=Rlist.

